import React, { useEffect, useState } from "react";
import { GoTrophy } from "react-icons/go";


export default function about() {
  return (
    <main className="w-fit mx-auto mt-[9rem] my-10 px-6 flex flex-col gap-y-6 text-lg max-md:text-sm">
        <AboutHeader/>
        <Container id={1} img="/images/about/1.webp" title="پخت نان و شیرینی فرانسوی" text="پخت تازه انواع نان (چیاباتا، سیمیت، چاودار و …) و شیرینی های فرانسوی ( از نوع خمیرهای چند لایه همچون توئیست شکلاتی،کروسان، رول دارچین و …) وانواع مافین به صورت  روزانه توسط تیم بیکری انجام می شود.بطور حتم استفاده از مواد اولیه مرغوب دلیل کیفیت بالای محصولات می باشد.قهوه همراه همیشه درصدد بوده تا با تکمیل تجهیزات خود و به روزرسانی آن با برندهای معتبر و باسابقه در دنیا (همچون فرهای Deck oven تخصصی  MIWE  آلمان و  Coldline و …) با استانداردهای روز دنیا همگام باشد."/>
        <Container id={2} img="/images/about/2.webp" title="قنادی" text="تیم قنادی قهوه همراه برای تحقق اهدافی از قبیل خلق بهترین طعم ها و لذت تجربه ی خاص ترین مزه ها در قالب دستورالعمل های مدرسه Le Cordlen Bleu در راستای ارزشمند شمردن سلامتی و ایجاد حس تازگی با باور اینکه جایز نیست که گوهر گرانبهای سلامتی خود را ارزان بفروشیم با مصرف مرغوب ترین مواد اولیه و تکیه بر متخصصین متبحر و دانش روز دنیا برای تولید شیرینی تلاش می کنند تا هیچ ذائقه ای را از قلم نیندازند  ."/>
        <div className="max-w-[1000px] my-4">
            <strong className="text-2xl text-orange-500 max-md:text-lg">بار گرم</strong>
            <p className=" mt-4 text-justify">به روزترین و تخصصی ترین دستگاه های عصاره گیری و دم آوری قهوه (اتوماتیک و نیمه اتوماتیک) شرایطی را ایجاد کرده که در کمترین زمان نوشیدنی هایی با تعادل طعمی یکسان، مطابق استانداردهای روز تولید شود. در این قسمت باریستاهای مجرب و آموزش دیده در سطح و چهارچوب SCA (سازمان قهوه تخصصی) برروی نوشیدنی نهایی و کیفیت نظارت دارند و همه ی تلاششان این است که نوشیدنی درخور سلیقه قهوه دوستان ارائه دهند.همانطور که می دانید اساسی ترین مواد اولیه برای بار گرم شیر و قهوه است. قهوه همراه با استفاده از شیرهای تاریخ روز و ارگانیک با تنوعی از قبیل پرچرب، نیم چرب، بدون لاکتوز بصورت روزانه و هم چنین تهیه و فراهم کردن قهوه طی آزمون و خطا و سختگیری های QC (مسئول کنترل کیفی) این بخش، لاین هایی از مناطق و جوره های مختلف کمربند قهوه بصورت سینگل اورجین و بلند در بهترین زمان پس از رست برای عصاره گیری و دم آوری در بار شرایطی را محیا می کند تا بهترین طعم قهوه در خاطر مشتریان ماندگار شود.قهوه همراه دوست داران چای را فراموش نکرده، انتخاب برندهای معروف چای (Althaus, Steven Smith و …) با تنوعی از دمنوش های گیاهی و میوه ای و چای سیاه دستچین شده از دره آسام هند بصورت دمی و تی بگ بیانگر این موضوع است.   طراحی ظروف سرامیکی مجموعه توسط طراحان شرکت های Churchill انگلستان و Seltmann آلمان که با برجسته ترین کافه های دنیا ازقبیل Mac Cafe, StarBucks, Costa Coffee همکاری میکنند، سبب شد تا تنها اصل کیفیت، که ارائه نوشیدنی در ظروف مناسب با تکنولوژی حفظ میزان حرارت و گرمای نوشیدنی در بیشترین زمان ممکن است را الویت کار خود قرار دهیم. این ویژگی در ظروف بیرونبر (TakeAway) هم در نظر گرفته شده است. </p>
        </div>
        <Container id={3} img="/images/about/3.webp" title="رست" text="فعالیت این قسمت از مردادماه سال 1399 آغاز شد و ازدستگاه Giesen15w   هلندی که جزء به روزترین دستگاه های دنیاست استفاده میشود.ذهنیت و فعالیت ما از همان ابتدا بر روی قهوه های اسپشیالتی بوده و تلاش ما همیشه برین بوده که دانه سبزهای تازه با رطوبت و چگالی ایده ال و مناسب و درجه کیفی بالا انتخاب شود و تا به امروز انواع قهوه ها از آمریکای جنوبی ( گواتمالا،ال سالوادر ،کلمبیا و برزیل ) و قهوه های آفریقایی همچون ( اتیوپی ،کنیا ،اوگاندا،رواندا ،بروندی) با نژادهای مختلف نظیر گیشا ،بوربون،تیپیکا و…. تهیه شده است . عملکرد این قسمت به صورت هفتگی اینگونه است که قهوه ها بعد از رست از نظر کیفی کاپ می شود ( کاپینگ یعنی آزمودن کیفیت قهوه) و برای ثبات این کیفیت بلندهایی برای مصرف و فروش دانه رست شده تولید می شود به غیر از بلند ها ، قهوه های سینگل اورجین با درجه کیفی  بالا و90+ در پایدارترین حالت بعد از رست بسته بندی می شود وبرای سرو و فروش  به شعب قهوه همراه توزیع می گردد."/>
        <Container id={4} img="/images/about/4.webp" title="درایو ترو ( Drive thru )" text="قهوه همراه به عنوان اولین و تنها شعبه درایوترو(سفارش در خودرو) در ایران و اصفهان ، به صورتی که به  مشتریان این امکان را می دهد تا بدون ترک کردن اتومبیل سفارش خود را ثبت کرده ، پرداخت کنند و در کمترین زمان ممکن  تحویل بگیرند در سال 1398 در فضای طراحی شده جدید، که مختص این کاراست  در فعالیت خود را آغاز کرد .این سیستم نیازمند تجهیزات مخصوص خود بوده و نحوه عملکرد آن به این صورت است : یک عدد اسپیکر در ابتدای لاین درایو ترو تعبیه شده که با رسیدن اتومبیل به اسپیکر ارتباط با هدست قسمت های صندوق،سفارشگر و باریستاها برقرار می شود و سرنشیان پس از اعلام سفارش خود به سمت پنجره اول که به اصطلاح ( pay here ) یا پرداخت است راهنمایی می شوند ، در این قسمت نحوه قرار گرفتن دستگاه های خودپرداز به صورتی است که به راحتی به سمت پنجره اتومبیل هدایت می شود .تلاش بر این است در تمامی مراحل اعم از ثبت سفارش ،پرداخت و تحویل سفارش میزان تماس مشتری با افراد و دستگاه های پرداخت به حداقل میزان ممکن برساند ."/>
        <Container id={5} img="/images/about/6.webp" title="کاروان ( caravan )" text="از اقدامات نه چندان دور قهوه همراه به عنوان اولین وارد کننده کاروان های کابردی  ( کاروان در واژه نامه قهوه همراه  به معنای مجموعه ای قابل حمل متشکل از دستگاه های سرو قهوه و چای  ، همچنین پخت تازه نان و انواع شیرینی به صورت بیرون بر ) نوع جدیدی از سرویس دهی را در ایران  زمینه سازی کرد                                                      در سال 1399 قهوه همراه با همکاری شرکتی در انگلستان توانست 2 عدد کاروان در سایزهای مختلف با امکان سرو نوشیدنی و پخت نان و شیرینی به مجموعه خود اضافه کند .مجهز بودن به تمامی تجهیزاتی که هر کافه وبیکری با در نظرداشتن استاندارد های بهداشتی و ایمنی  به ان نیاز دارد از نکات مثبت کاروان های قهوه همراه می باشد  و این امر امکان سرو حداکثر سفارش در حداقل زمان را به صورت درایو ترو و بیرونبر ( take away ) میسر می کند ."/>
        <span className="p-3 px-6 mx-auto bg-gradient-to-br from-orange-600 to-orange-400 text-white flex gap-2 items-center rounded-xl text-3xl max-md:text-xl"><GoTrophy className="text-[2rem]"/>افتخارات</span>
        <p className="mx-auto">موبایل کافی در اکتبر 2017 موفق به دریافت جایزه ی <b className="text-orange-500">Quality star award paris</b>  شد .</p>
    </main>
  );
}

const AboutHeader = () => {
  return (
    <section className="w-3/4 bg-whtie relative bg-gradient-to-br from-orange-400 to-orange-600 text-white  rounded-2xl  shadow-md p-4 flex flex-col mx-auto my-12 max-md:w-full max-md:mb-4">
      <img className="size-40 absolute right-1/2 bg-white z-30 shadow-2xl rounded-full p-2 transform translate-x-1/2 -top-20 " src="images/logo.webp" alt="" /> 
      <p className="max-w-[50rem]  text-center mt-24 ">موبایل کافی با نام فارسی قهوه همراه از سال 2013 با مدیریت آقای مجید ساطعی با هدف ارائه بهترین نوع قهوه اسپشیالیتی در کمترین زمان ممکن با دستگاه های پیشرفته دنیا و به صورت بیرون بر ( Take Away) با توجه به نیاز کشور به اینگونه سرویس دهی در صنعت قهوه شروع بکار کرد.
پنج حوزه فعالیت قهوه همراه به شرح زیر می باشد:</p>
    </section>
  )
}

const Container = ({id , title , text , img}) => {

    const [isEven , setIsEven] = useState(false)

    useEffect(() => {
        setIsEven(id % 2 == 0)
    } , [id])

    return (
        <div className={`max-w-[1000px]  p-2 to-white my-6 justify-between flex gap-x-10 mx-auto w-fit items-center max-md:my-0 max-md:flex-col max-md:gap-y-4  max-md:border-none ${isEven ? 'md:border-l-4 flex-row-reverse' : 'md:border-r-4'} border-orange-400 md:px-8 max-sm:p-2`}>
        <div className="w-1/2 max-md:w-full">
          <strong className="text-2xl text-orange-500 max-md:text-lg">{title}</strong>
          <p className="mt-6  text-justify">{text}</p>
        </div>
        <img alt={title} className="rounded-2xl shadow-2xl" src={img}/>
      </div>
    )
}